Autodesk.Revit.DB.Floor.StructuralUsage
The floors designated structural usage, such as bearing or non bearing.
Remarks: The StructuralUsage property is a read only property that returns the walls designated
usage. Example values of this property are Non Bearing, Bearing, Shear, Combined etc.